app/views/rooms/_review.html.erb

SELECT AVG("reviews"."points") FROM "reviews" WHERE "reviews"."room_id" = ?  [["room_id", 1]]
---

		<% (room.review_points.max - room.stars).times do %>