app/controllers/rooms_controller.rb

  def index
    @search_query = params[:q]

    rooms = Room.search(@search_query).page(params[:page]).per(PER_PAGE)
---
SELECT "rooms".* FROM "rooms" WHERE (location LIKE '%Teste%' OR title LIKE '%Teste%' OR description LIKE '%Teste%')  ORDER BY "rooms"."created_at" ASC
SELECT COUNT(*) FROM "rooms"

  def show
    room_model = Room.friendly.find(params[:id])
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @room = current_user.rooms.friendly.find(params[:id])
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."user_id" = ? AND "rooms"."id" = ? LIMIT 1  [["user_id", 21], ["id", 1]]

  def create
    @room = current_user.rooms.build(room_params)

    if @room.save
---
INSERT INTO "rooms" ("title", "location", "user_id", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Casa"], ["location", "Concórdia"], ["user_id", 21], ["slug", "casa"], ["created_at", "2015-01-26 21:15:12.362770"], ["updated_at", "2015-01-26 21:15:12.362770"]]

  def update
    @room = current_user.rooms.friendly.find(params[:id])

    if @room.update(room_params)
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "rooms" SET "picture" = ?, "updated_at" = ? WHERE "rooms"."id" = ?  [["picture", "quarto.jpg"], ["updated_at", "2015-01-26 22:14:24.717837"], ["id", 2]]

  def destroy
    @room = current_user.rooms.friendly.find(params[:id])
    @room.destroy
---
DELETE FROM "rooms" WHERE "rooms"."id" = ?  [["id", 4]]